---
type: ElementIdParameterValue
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementIdParameterValue

`Autodesk.Revit.DB.ElementIdParameterValue` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementIdParameterValue | — | `` |
| Constructor | ElementIdParameterValue | 2016 Subscription Update | `public ElementIdParameterValue ()` |
| Property | Value | 2016 Subscription Update | `public ElementId Value { get ; set ; }` |